<a href="https://colab.research.google.com/github/gaganreddy7977/python-assignment/blob/main/pandas_Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [4]:
import pandas as pd

In [24]:
#------------------loading the data set---------------------
data_set=pd.read_excel('Sample - Superstore.xls')

In [19]:
print('Question 1: Find total number of orders in the dataset.')
data_set['Order ID'].unique()

Question 1: Find total number of orders in the dataset.

array(['CA-2016-152156', 'CA-2016-138688', 'US-2015-108966', ...,
       'CA-2014-110422', 'CA-2017-121258', 'CA-2017-119914'], dtype=object)

In [18]:
print('Question 2: Find the earliest order date.')
data_set['Order Date'].min()

Question 2: Find the earliest order date.

Timestamp('2014-01-03 00:00:00')

In [17]:
print('Question 3: Find the latest order date.')
data_set['Order Date'].max()

Question 3: Find the latest order date.

Timestamp('2017-12-30 00:00:00')

In [20]:
print(' Question 4: Find the total number of unique customers.')
number=data_set['Customer Name'].unique()
unique_customers=len(number)
unique_customers

 Question 4: Find the total number of unique customers.

793

In [33]:
print('Question 5: Find the total number of unique products sold.')
pd.Series(data_set['Product ID'].unique())

Question 5: Find the total number of unique products sold.

0       FUR-BO-10001798
1       FUR-CH-10000454
2       OFF-LA-10000240
3       FUR-TA-10000577
4       OFF-ST-10000760
             ...
1857    TEC-PH-10002817
1858    TEC-MA-10003589
1859    OFF-AP-10003099
1860    TEC-PH-10002645
1861    OFF-ST-10001627
Length: 1862, dtype: object

In [31]:
print('Question 6: Find the total number of unique categories.')
pd.Series(data_set['Category'].unique())

Question 6: Find the total number of unique categories.

0          Furniture
1    Office Supplies
2         Technology
dtype: object

In [32]:
print('Question 7: Find the total number of unique sub-categories.')
pd.Series(data_set['Sub-Category'].unique)

Question 7: Find the total number of unique sub-categories.

0    <bound method Series.unique of 0         Bookc...
dtype: object

In [42]:
print('Question 8: Count number of orders in each region.')
# south_total=0
# west_total=0
# East_total=0
# center_total=0
# for i in data_set['Region']:
#   if i=='South':
#     south_total=south_total+1
#   elif i=='West':
#     west_total=west_total+1
#   elif i=='Central':
#    center_total=center_total+1
#   elif i=='East':
#     East_total=East_total+1
# print(south_total)
# print(west_total)
# print(East_total)
# print(center_total)

data_set['Region'].value_counts()

Question 8: Count number of orders in each region.

Region
West       3203
East       2848
Central    2323
South      1620
Name: count, dtype: int64

In [44]:
print('Question 9: Count number of orders by state.')
data_set['State'].value_counts()

Question 9: Count number of orders by state.

State
California              2001
New York                1128
Texas                    985
Pennsylvania             587
Washington               506
Illinois                 492
Ohio                     469
Florida                  383
Michigan                 255
North Carolina           249
Arizona                  224
Virginia                 224
Georgia                  184
Tennessee                183
Colorado                 182
Indiana                  149
Kentucky                 139
Massachusetts            135
New Jersey               130
Oregon                   124
Wisconsin                110
Maryland                 105
Delaware                  96
Minnesota                 89
Connecticut               82
Missouri                  66
Oklahoma                  66
Alabama                   61
Arkansas                  60
Rhode Island              56
Utah                      53
Mississippi               53
South Carolina            42
Louisiana                 42
Nevada                    39
Nebraska                  38
New Mexico                37
Iowa                      30
New Hampshire             27
Kansas                    24
Idaho                     21
Montana                   15
South Dakota              12
Vermont                   11
District of Columbia      10
Maine                      8
North Dakota               7
West Virginia              4
Wyoming                    1
Name: count, dtype: int64

In [45]:
print('Question 10: Count number of orders by city.')
data_set['City'].value_counts()

Question 10: Count number of orders by city.

City
New York City    915
Los Angeles      747
Philadelphia     537
San Francisco    510
Seattle          428
                ...
Abilene            1
Montebello         1
Kissimmee          1
Danbury            1
Springdale         1
Name: count, Length: 531, dtype: int64

In [49]:
print('Question 11: Find the most common ship mode.')
data_set['Ship Mode'].mode()

Question 11: Find the most common ship mode.

0    Standard Class
Name: Ship Mode, dtype: object

In [55]:
print('Question 12: Find the least common ship mode.')
least_common=data_set['Ship Mode'].min()
least_common

Question 12: Find the least common ship mode.

'First Class'

In [75]:
print('Question 13: Count number of orders shipped with "Same Day" mode.')
data_set['Ship Mode'].value_counts()['Same Day']

Question 13: Count number of orders shipped with "Same Day" mode.

np.int64(543)

In [78]:
print('Question 14: Count number of orders shipped with "First Class".')
data_set['Ship Mode'].value_counts()['First Class']

Question 14: Count number of orders shipped with "First Class".

np.int64(1538)

In [79]:
print('Question 15: Count number of orders shipped with "Second Class".')
data_set['Ship Mode'].value_counts()["Second Class"]

Question 15: Count number of orders shipped with "Second Class".

np.int64(1945)

In [80]:
print('Question 16: Count number of orders shipped with "Standard Class".')
data_set['Ship Mode'].value_counts()["Standard Class"]

Question 16: Count number of orders shipped with "Standard Class".

np.int64(5968)

In [88]:
print('Question 17: Find number of orders in each year.')
data_set['Order Date'].dt.year.value_counts()

Question 17: Find number of orders in each year.

Order Date
2017    3312
2016    2587
2015    2102
2014    1993
Name: count, dtype: int64

In [92]:
print('Question 18: Find number of orders in each quarter.')
data_set['Order Date'].dt.quarter

Question 18: Find number of orders in each quarter.

0       4
1       4
2       2
3       4
4       4
       ..
9989    1
9990    1
9991    1
9992    1
9993    2
Name: Order Date, Length: 9994, dtype: int32

In [100]:
print('Question 19: Find number of orders in each month.')
data_set['Order Date'].dt.month.value_counts()

Question 19: Find number of orders in each month.

Order Date
11    1471
12    1408
9     1383
10     819
5      735
6      717
7      710
8      706
3      696
4      668
1      381
2      300
Name: count, dtype: int64

In [110]:
print('Question 20: Find number of orders in each weekday.')
data_set['Order Date'].dt.day_name().value_counts()

Question 20: Find number of orders in each weekday.

Order Date
Monday       1871
Friday       1818
Sunday       1710
Saturday     1655
Thursday     1463
Tuesday      1106
Wednesday     371
Name: count, dtype: int64

In [118]:
print('Question 21: Count orders with discount applied.')
discount_applied=data_set['Discount'].apply(lambda x:x>0).sum()
discount_applied

Question 21: Count orders with discount applied.

np.int64(5196)

In [119]:
print('Question 22: Count orders without discount.')
discount_applied=data_set['Discount'].apply(lambda x:x<0).sum()
discount_applied

Question 22: Count orders without discount.

np.int64(0)

In [121]:
print('Question 23: Count orders where discount = 0.')
discount_applied=data_set['Discount'].apply(lambda x:x==0).sum()
discount_applied

Question 23: Count orders where discount = 0.

np.int64(4798)

In [122]:
print('Question 24: Count orders where discount > 0.2.')
discount_applied=data_set['Discount'].apply(lambda x:x>0.2).sum()
discount_applied

Question 24: Count orders where discount > 0.2.

np.int64(1393)

In [123]:
print('Question 25: Count orders where discount = 0.5.')
discount_applied=data_set['Discount'].apply(lambda x:x==0.5).sum()
discount_applied

Question 25: Count orders where discount = 0.5.

np.int64(66)

In [125]:
print('Question 26: Find maximum discount given.')
data_set['Discount'].max()

Question 26: Find maximum discount given.

0.8

In [126]:
print('Question 27: Find minimum discount given.')
data_set['Discount'].min()

Question 27: Find minimum discount given.

0.0

In [128]:
print('Question 28: Count orders where profit < 0.')
profit=data_set['Profit'].apply(lambda x:x<0).sum()
profit

Question 28: Count orders where profit < 0.

np.int64(1871)

In [129]:
print('Question 29: Count orders where profit = 0.')
profit=data_set['Profit'].apply(lambda x:x==0).sum()
profit

Question 29: Count orders where profit = 0.

np.int64(65)

In [130]:
print('Question 30: Count orders where profit > 100.')
profit=data_set['Profit'].apply(lambda x:x>0).sum()
profit

Question 30: Count orders where profit > 100.

np.int64(8058)

In [131]:
print('Question 31: Count orders where sales > 1000.')
data_set['Sales'].apply(lambda x:x>1000).sum()

Question 31: Count orders where sales > 1000.

np.int64(468)

In [133]:
print('Question 32: Find total quantity sold.')
data_set['Quantity'].sum()

Question 32: Find total quantity sold.

np.int64(37873)

In [145]:
print('Question 33: Find average quantity per order.')
data_set['Order ID'].value_counts().sum()

Question 33: Find average quantity per order.

np.int64(9994)

In [152]:
print('Question 34: Find average sales per order.')
total=data_set.groupby('Order ID')['Quantity'].sum()
total.mean()

Question 34: Find average sales per order.

np.float64(7.560990217608305)

In [152]:

print('Question 35: Find average profit per order.')

In [147]:
data_set.columns

Index(['Row ID', 'Order ID', 'Order Date', 'Ship Date', 'Ship Mode',
       'Customer ID', 'Customer Name', 'Segment', 'Country', 'City', 'State',
       'Postal Code', 'Region', 'Product ID', 'Category', 'Sub-Category',
       'Product Name', 'Sales', 'Quantity', 'Discount', 'Profit'],
      dtype='object')